<?php
/**
 * +--------------------------------------------------------
 * | 文件上传配置
 * +--------------------------------------------------------
 */
return [
    // +----------------------------------------------------------------------
    // | web端 - 文件上传口令
    // +----------------------------------------------------------------------
    'up_token' => 'FFFX123456',
    
    // +----------------------------------------------------------------------
    // | 文件上传的服务器存储路径(本地)
    // +----------------------------------------------------------------------
    'upload_path'=>'./public/uploads',
    
    // +----------------------------------------------------------------------
    // | 文件归档类型
    // +----------------------------------------------------------------------
    'filetype' => [
        'img'  => ['jpg','jpeg','png','gif','bmp','ico'], # 图片格式
        'vdo'  => ['flv','swf','mp4','ts','mp3','ogg'], # 音频格式
        'app'  => ['apk','ios'], # 应用格式
        'doc'  => ['doc','docx','xls','xlsx','ppt','pptx','pdf','txt','xml'], # document 文档格式
        'pack' => ['rar','zip','tar','gz','7z','bz2','iso'] # package 压缩包格式
    ],
    
    // +----------------------------------------------------------------------
    // | 本地文件上传设置
    // +----------------------------------------------------------------------
    'upload' => [
        'classify' => true, # 文件分类存储,参照类型config('upload.filetype')  [img]/20180129/123.jpg , 选填
        'ext'      => [
                'jpg','jpeg','png','gif','bmp','ico', # 图片
                'flv','swf','mp4','ts','mp3','ogg', # 音频
                'apk','ios', # APP
                'doc','docx','xls','xlsx','ppt','pptx','pdf','txt','xml', # 文档
                'rar','zip','tar','gz','7z','bz2','iso' # 压缩包
        ],
        'img_size'=> 2097152, #  图片上传大小限制最大 2M
        'size'    => 314572800 # 其他文件上传大小限制最大 300M
    ],
    
    // +----------------------------------------------------------------------
    // | 七牛文件上传设置
    // +----------------------------------------------------------------------
    'qupload'=>[
        'AK' => '', # QINIU_ACCESS_KEY , 必填
        'SK' => '', # QINIU_SECRET_KEY , 必填
        'bucket' => '', # 七牛云空间名 , 必填
        'path_prefix' => 'upload/', # 路径前缀可以用来分类文件，例如： [image/jpg/]your-file-name.jpg 中的 image/jpg/ , 选填
        'expires'=> 7200, # 2小时，expires单位为秒，为上传凭证的有效时间,默认是1个小时
        'sync'=> false      # true文件上传同步七牛云 , false本地服务器不保留该文件仅上传到七牛云
    ],
];
